<script setup lang="ts">
import MainContent from '@/components/MainContent.vue'
import { ref, onMounted, computed } from 'vue'

const loading = ref(false)

const filterItem = ref<string | null>(null)

const filters = [
  { label: '全て', value: null },
  { label: 'Faculty', value: 'Faculty' },
  { label: '博士', value: '博士' },
  { label: '修士', value: '修士' },
  { label: '学部生', value: '学部生' },
  { label: '卒業生', value: '卒業生' }
]

interface Participant {
  name: string
  loginname: string
  attribute: string
}

const participants = ref<Participant[]>([])

const sortedParticipants = computed(() => {
  const _participants = participants.value
  _participants.sort((a, b) => {
    const order = ['Faculty', '博士', '修士', '学部生', '卒業生']
    const aIndex = order.indexOf(a.attribute)
    const bIndex = order.indexOf(b.attribute)
    return aIndex - bIndex
  })
  if (filterItem.value) {
    return _participants.filter((item) => item.attribute === filterItem.value)
  }
  return _participants
})

onMounted(() => {
  participants.value = data.map((item) => {
    return {
      name: item['フルネーム'],
      loginname: item['ログイン名'],
      attribute: item['属性']
    }
  })
})

const data = [
  {
    タイムスタンプ: '2023/11/17 16:51:31',
    メールアドレス: 'tkprogram@keio.jp',
    属性: '修士',
    ログイン名: 'tappun',
    フルネーム: '柄澤 匠',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/17 17:25:58',
    メールアドレス: 'kny_i@keio.jp',
    属性: '学部生',
    ログイン名: 'kny-i',
    フルネーム: '近藤祐綺',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/17 17:30:42',
    メールアドレス: 's.makino@keio.jp',
    属性: '修士',
    ログイン名: 'kino-ma',
    フルネーム: '牧野青希',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/18 0:00:09',
    メールアドレス: 'gerry.huang@keio.jp',
    属性: '博士',
    ログイン名: 'gerry',
    フルネーム: '黄　文浩',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: 'パイナップル',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/18 17:44:45',
    メールアドレス: 'nk@keio.jp',
    属性: '学部生',
    ログイン名: 'naoyashi',
    フルネーム: '小林尚輝',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/20 10:49:38',
    メールアドレス: 'g10-da1suke175@keio.jp',
    属性: '学部生',
    ログイン名: 'dang0',
    フルネーム: '後藤大介',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/20 15:32:19',
    メールアドレス: 'shota1151020@keio.jp',
    属性: '学部生',
    ログイン名: 'shoppiee',
    フルネーム: '山中翔太',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 13:59:41',
    メールアドレス: 'skk@bpsinc.jp',
    属性: '卒業生',
    ログイン名: 'skk',
    フルネーム: '榊原寛',
    卒業年度を教えてください: '2010',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:02:44',
    メールアドレス: 'takuro.yonezawa@gmail.com',
    属性: '卒業生',
    ログイン名: 'takuro',
    フルネーム: '米澤拓郎',
    卒業年度を教えてください: '2010',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:11:40',
    メールアドレス: 'hide112203@keio.jp',
    属性: '学部生',
    ログイン名: 'hidechan',
    フルネーム: '入部英成',
    卒業年度を教えてください: '26年度予定',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:15:35',
    メールアドレス: 'ychen@reitaku-u.ac.jp',
    属性: 'Faculty',
    ログイン名: 'yin',
    フルネーム: '陳　寅',
    卒業年度を教えてください: '現役',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:21:56',
    メールアドレス: 'hok.kanny@gmail.com',
    属性: '卒業生',
    ログイン名: 'kanny',
    フルネーム: '星 北斗',
    卒業年度を教えてください: '2013',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）':
      '幹事おつかれさまです！当日楽しみにしております。'
  },
  {
    タイムスタンプ: '2023/11/21 14:30:11',
    メールアドレス: 'tatsuru@keio.jp',
    属性: '修士',
    ログイン名: 'tatsuru',
    フルネーム: '富澤 立',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:37:05',
    メールアドレス: 'taiga.k-25@keio.jp',
    属性: '修士',
    ログイン名: 'hhiromasa',
    フルネーム: '久米大雅',
    卒業年度を教えてください: '2025',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 14:39:43',
    メールアドレス: 'kyono@kyopalab.com',
    属性: '卒業生',
    ログイン名: 'kyopan',
    フルネーム: '興野 悠太郎',
    卒業年度を教えてください: '2014',
    '同行者の方は何人参加されますか？': '0~3',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: 'ヘビの血が入った酒',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 15:38:00',
    メールアドレス: 'amano.kenz@gmail.com',
    属性: '卒業生',
    ログイン名: 'amazon',
    フルネーム: '天野　賢二',
    卒業年度を教えてください: '2010',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/21 18:08:34',
    メールアドレス: 'matsubokkuri@gmail.com',
    属性: '卒業生',
    ログイン名: 'matsu',
    フルネーム: '松倉　友樹',
    卒業年度を教えてください: '2005',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/22 6:43:47',
    メールアドレス: 'katsuya.h@gmail.com',
    属性: '卒業生',
    ログイン名: 'katsuya',
    フルネーム: '橋爪克弥',
    卒業年度を教えてください: '2010/3',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/22 11:56:38',
    メールアドレス: 'takuya.takimoto@gmail.com',
    属性: '卒業生',
    ログイン名: 'tacky',
    フルネーム: '瀧本拓哉',
    卒業年度を教えてください: '2013',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': 'wataruさんとめちゃくちゃ飲みたいです'
  },
  {
    タイムスタンプ: '2023/11/22 16:24:50',
    メールアドレス: 'tainakamura@keio.jp',
    属性: '学部生',
    ログイン名: 'tyler',
    フルネーム: '中村泰',
    卒業年度を教えてください: '2026',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: 'キウイフルーツ',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/24 11:32:59',
    メールアドレス: 'jumpei.yamamoto@worklog-inc.com',
    属性: '卒業生',
    ログイン名: 'jum-p',
    フルネーム: '山本純平',
    卒業年度を教えてください: 'richieと一緒！',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': '会費周知しなくて大丈夫ですか？'
  },
  {
    タイムスタンプ: '2023/11/24 12:09:16',
    メールアドレス: 'h.tokuda00@gmail.com',
    属性: 'Faculty',
    ログイン名: 'hxt',
    フルネーム: 'Hideyuki Tokuda',
    卒業年度を教えてください: '2018年3月',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）':
      '恒例だったクリスマスプレゼントの交換会も復活してもらえそうですか？'
  },
  {
    タイムスタンプ: '2023/11/24 18:55:14',
    メールアドレス: 'ito.masaki@sict.i.u-tokyo.ac.jp',
    属性: '卒業生',
    ログイン名: 'niya',
    フルネーム: '伊藤昌毅',
    卒業年度を教えてください: '98年度入学・2000〜2010年に徳田研究室に在籍',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/24 19:39:03',
    メールアドレス: 'shury0814@gmail.com',
    属性: 'Faculty',
    ログイン名: 'shury',
    フルネーム: '丸井朱里',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '息子1人(2歳)',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/24 20:29:05',
    メールアドレス: 'satsuki.hashiba@keio.jp',
    属性: '卒業生',
    ログイン名: 'shiba',
    フルネーム: '羽柴彩月',
    卒業年度を教えてください: '2022',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/24 20:36:07',
    メールアドレス: 'richie69star@gmail.com',
    属性: '卒業生',
    ログイン名: 'richie',
    フルネーム: '小川正幹',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/24 21:31:57',
    メールアドレス: 'soko@kadinche.com',
    属性: '卒業生',
    ログイン名: 'soko',
    フルネーム: '青木崇行',
    卒業年度を教えてください: '2001',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/25 10:16:21',
    メールアドレス: 'hiroki.nozaki@softroid.jp',
    属性: '卒業生',
    ログイン名: 'chacha',
    フルネーム: '野﨑大幹',
    卒業年度を教えてください: '2018',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/25 10:30:09',
    メールアドレス: 'kageshima23@keio.jp',
    属性: '修士',
    ログイン名: 'shiryo',
    フルネーム: '影嶋亮太朗',
    卒業年度を教えてください: '25卒',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/26 16:41:47',
    メールアドレス: 'higutomo.0814@keio.jp',
    属性: '学部生',
    ログイン名: 'higu',
    フルネーム: '樋口朋香',
    卒業年度を教えてください: '2024',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/30 17:13:46',
    メールアドレス: 'masaiwai@gmail.com',
    属性: 'Faculty',
    ログイン名: 'tailor',
    フルネーム: '岩井将行',
    卒業年度を教えてください: '2002',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': '久しいぶりにお邪魔いたします。'
  },
  {
    タイムスタンプ: '2023/11/30 18:10:43',
    メールアドレス: 'owl20050127@gmail.com',
    属性: '学部生',
    ログイン名: 'komiya',
    フルネーム: '古宮祥太',
    卒業年度を教えてください: '2027',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/30 19:22:25',
    メールアドレス: 'inuiyuki0904@gmail.com',
    属性: '学部生',
    ログイン名: 'inui',
    フルネーム: '乾雄貴',
    卒業年度を教えてください: '2024',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: 'えび',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/30 19:49:41',
    メールアドレス: 'liutongyu0623@keio.jp',
    属性: '学部生',
    ログイン名: 'sueko',
    フルネーム: '劉桐羽',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/11/30 20:57:09',
    メールアドレス: 'yukahon@sfc.keio.ac.jp',
    属性: 'Faculty',
    ログイン名: 'Yuka Honda',
    フルネーム: '本田由佳',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/01 19:36:52',
    メールアドレス: 'masatomo.m@gmail.com',
    属性: '卒業生',
    ログイン名: 'morimori',
    フルネーム: '森　雅智',
    卒業年度を教えてください: '記憶が、、、cheさんとかzoeさんと同期です',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/03 17:05:38',
    メールアドレス: 's07802sh@gmail.com',
    属性: '卒業生',
    ログイン名: 'hiru',
    フルネーム: '蛭田 慎也',
    卒業年度を教えてください: '2012',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/04 11:45:38',
    メールアドレス: 'takafumi_kawasaki@pu-toyama.ac.jp',
    属性: 'Faculty',
    ログイン名: 'drgnman',
    フルネーム: '河崎隆文',
    卒業年度を教えてください: '2022',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/04 13:01:12',
    メールアドレス: 'iwamoto@pu-toyama.ac.jp',
    属性: '卒業生',
    ログイン名: 'iwaiwa',
    フルネーム: '岩本健嗣',
    卒業年度を教えてください: '2005',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 10:18:08',
    メールアドレス: 'hironok@sfc.keio.ac.jp',
    属性: '博士',
    ログイン名: 'hirono',
    フルネーム: '川島寛乃',
    卒業年度を教えてください: '現役',
    '同行者の方は何人参加されますか？': '1名(0歳児)',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）':
      '子供を連れて行かせていただきたいと思います。途中ミルクで抜けたり機嫌によってはお先に失礼させていただいたり、ご迷惑おかけするかもしれません。宜しくお願いいたします。'
  },
  {
    タイムスタンプ: '2023/12/05 13:45:32',
    メールアドレス: 'takatoshiraki0127@keio.jp',
    属性: '学部生',
    ログイン名: 'takaato',
    フルネーム: '白木嵩人',
    卒業年度を教えてください: '2025',
    '同行者の方は何人参加されますか？': '自分だけ',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 14:05:04',
    メールアドレス: 'gotokentaro0611@keio.jp',
    属性: '学部生',
    ログイン名: 'gozu',
    フルネーム: '五頭健太郎',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 14:17:21',
    メールアドレス: 'tsukky67@keio.jp',
    属性: '学部生',
    ログイン名: 'tsukky',
    フルネーム: '月館力哉',
    卒業年度を教えてください: '2024',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 14:39:08',
    メールアドレス: 'cho.kaho@keio.jp',
    属性: '学部生',
    ログイン名: 'haly',
    フルネーム: '張嘉宝',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 14:41:31',
    メールアドレス: 'tomotaka.ito@gmail.com',
    属性: 'Faculty',
    ログイン名: 'tomotaka',
    フルネーム: '伊藤友隆',
    卒業年度を教えてください: '2010',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 20:10:59',
    メールアドレス: 'ysukegawa@keio.jp',
    属性: '卒業生',
    ログイン名: 'suke',
    フルネーム: '助川 友理',
    卒業年度を教えてください: '2021',
    '同行者の方は何人参加されますか？': '無',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 20:41:44',
    メールアドレス: 'wataruew@sfc.keio.ac.jp',
    属性: 'Faculty',
    ログイン名: 'wataru',
    フルネーム: '佐々木航',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/05 20:57:00',
    メールアドレス: 'kozk2414@keio.jp',
    属性: '学部生',
    ログイン名: 'zackey',
    フルネーム: '尾崎慶次郎',
    卒業年度を教えてください: '2026',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 0:37:05',
    メールアドレス: 'kawatiya@jp.ibm.com',
    属性: '卒業生',
    ログイン名: 'kawatiya',
    フルネーム: '河内谷清久仁',
    卒業年度を教えてください: '1995年ごろ共同研究',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '不参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 14:20:54',
    メールアドレス: 'slash@sfc.keio.ac.jp',
    属性: 'Faculty',
    ログイン名: 'slash',
    フルネーム: '大越匡',
    卒業年度を教えてください: '2015',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 14:25:41',
    メールアドレス: 'jin@sfc.keio.ac.jp',
    属性: 'Faculty',
    ログイン名: 'jin',
    フルネーム: '中澤仁',
    卒業年度を教えてください: '2004',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 14:50:07',
    メールアドレス: 'cc@keio.jp',
    属性: '修士',
    ログイン名: 'hakusai',
    フルネーム: '張　博セイ',
    卒業年度を教えてください: '2024',
    '同行者の方は何人参加されますか？': '1',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 18:44:15',
    メールアドレス: 'ally@keio.jp',
    属性: '修士',
    ログイン名: 'akiho',
    フルネーム: '岩田あきほ',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 21:06:41',
    メールアドレス: 'ytobe88@gnail.com',
    属性: 'Faculty',
    ログイン名: '',
    フルネーム: '戸辺義人',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/07 22:52:08',
    メールアドレス: 'bekku_squall@keio.jp',
    属性: '修士',
    ログイン名: 'bekku',
    フルネーム: '別宮広朗',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/09 1:40:15',
    メールアドレス: 'isokaze@sfc.keio.ac.jp',
    属性: '修士',
    ログイン名: 'isokaze',
    フルネーム: '張　遠沢',
    卒業年度を教えてください: '2024',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '参加',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/09 23:51:37',
    メールアドレス: 'alexandriasuzu@keio.jp',
    属性: '学部生',
    ログイン名: 'suzuto',
    フルネーム: '坂本涼都',
    卒業年度を教えてください: '24',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/09 23:55:08',
    メールアドレス: 'kxn.mail@gmail.com',
    属性: '卒業生',
    ログイン名: 'ken',
    フルネーム: '中西 健一',
    卒業年度を教えてください: '2002',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: 'えび',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/10 7:37:06',
    メールアドレス: 'quantan@sfc.keio.ac.jp',
    属性: '博士',
    ログイン名: 'quantan',
    フルネーム: '三上量弘',
    卒業年度を教えてください: '',
    '同行者の方は何人参加されますか？': '0人',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  },
  {
    タイムスタンプ: '2023/12/10 13:31:34',
    メールアドレス: 'karasu.915@gmail.com',
    属性: '卒業生',
    ログイン名: 'karasu',
    フルネーム: '唐津豊',
    卒業年度を教えてください: '2012',
    '同行者の方は何人参加されますか？': '0',
    食物アレルギーをお持ちの方のみあてはまるものをお選びください: '',
    '二次会があった場合参加されますか？': '未定',
    '備考欄（何がご要望がございましたらお書きください）': ''
  }
]

// function fetchParticipants() {
//   loading.value = true
//   const url = 'https://api.sheety.co/9d16b6b7e0afa9dd48e3fcf1257b3c4f/xmasParticipant/form1'
//   fetch(url)
//     .then((response) => response.json())
//     .then((json) => {
//       participants.value = json.form1.map((item: any) => ({
//         name: item.フルネーム,
//         loginname: item.ログイン名,
//         attribute: item.属性
//       }))
//     })
//     .catch((error) => {
//       console.error('データの取得中にエラーが発生しました:', error)
//     })
//     .finally(() => {
//       loading.value = false
//     })
// }
</script>

<template>
  <MainContent title="参加者一覧">
    <div v-if="!loading">
      <div>
        <h2>現在の参加人数: {{ sortedParticipants.length }}人</h2>
        <select v-model="filterItem">
          <option v-for="filter in filters" :key="filter.value ?? ''" :value="filter.value">
            {{ filter.label }}
          </option>
        </select>
      </div>
      <table>
        <tr>
          <th>参加者氏名</th>
          <th>ログイン名</th>
          <th>属性</th>
        </tr>
        <tr v-for="participant in sortedParticipants" :key="participant.name">
          <td>{{ participant.name }}</td>
          <td>{{ participant.loginname }}</td>
          <td>{{ participant.attribute }}</td>
        </tr>
      </table>
    </div>
    <div v-else>読み込み中</div>
  </MainContent>
</template>
<style>
table {
  border-collapse: collapse;
  width: 100%;
}

th,
td {
  border: 1px solid black;
  padding: 8px;
  text-align: left;
}

select {
  width: 100%;
  height: 40px;
  font-size: 1rem;
  padding: 0 10px;
  border-radius: 5px;
  border: 1px solid #ccc;
  outline: none;
  appearance: none;
  background: url("data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='16' height='16' fill='%23333333' viewBox='0 0 16 16'%3E%3Cpath d='M8 10.586L4.707 7.293a1 1 0 00-1.414 1.414l4 4a1 1 0 001.414 0l4-4a1 1 0 00-1.414-1.414L8 10.586z'/%3E%3C/svg%3E")
    no-repeat right 10px center/15px 15px;
  margin-bottom: 10px;
}
</style>
